<template lang="pug">
<article>
  <h2 class="text-center py-1">История</h2>
  <div class="p-3">
    <p>Первый патент на однокристальную микроЭВМ был выдан в 1971 году инженерам Майклу Кокрэну и Гэри Буну, сотрудникам американской Texas Instruments. Именно они предложили на одном кристалле разместить не только процессор, но и память с устройствами ввода-вывода (отличительные особенности микроконтроллеров).</p>
    <figure>
      <figcaption>
        
      </figcaption>
      <img src=""/>
    </figure>
    <p>В 1976 году американская фирма Intel выпускает микроконтроллер i8048.</p>
    <figure class="w-50 mx-auto">
      <img src="img/i8048.jpg" alt="i8048" title="i8048" class="mx-auto" width="100%"/>
      <figcaption>
          <p>i8048 от Intel</p>
      </figcaption>
    </figure>
    <p>В 1978 году фирма Motorola выпустила свой первый микроконтроллер MC6801, совместимый по системе команд с выпущенным ранее микропроцессором MC6800.</p>
    <figure class="w-50 mx-auto">
      <img src="img/MC6801.jpg" alt="MC6801" title="MC6801" class="mx-auto" width="100%"/>
      <figcaption>
          <p>MC6801 от Motorola</p>
      </figcaption>
    </figure>
    <p>В 1980 году Intel выпускает следующий микроконтроллер: i8051. Удачный набор периферийных устройств, возможность гибкого выбора внешней или внутренней программной памяти и приемлемая цена обеспечили этому микроконтроллеру успех на рынке. С точки зрения технологии микроконтроллер i8051 являлся для своего времени очень сложным изделием — в кристалле было использовано 128 тыс. транзисторов, что в 4 раза превышало количество транзисторов в 16-разрядном микропроцессоре i8086.</p>
    <figure class="w-50 mx-auto">
      <img src="img/i8051.jpg" alt="i8051" title="i8051" class="mx-auto" width="100%"/>
      <figcaption>
          <p>i8051 от Intel</p>
      </figcaption>
    </figure>
    <p>В СССР велись разработки оригинальных микроконтроллеров, также осваивался выпуск клонов наиболее удачных зарубежных образцов. В 1979 году в СССР НИИ ТТ разработали однокристальную 16-разрядную ЭВМ К1801ВЕ1, микроархитектура которой получила название «Электроника НЦ».</p>
    <figure class="w-50 mx-auto">
      <img src="img/K1801BE1.jpg" alt="K1801BE1" title="K1801BE1" class="mx-auto" width="100%"/>
      <figcaption>
          <p>K1801BE1 от Электроника НЦ</p>
      </figcaption>
    </figure>
    <p>Первые микроконтроллеры (МК) AVR были разработаны в 1996 году компанией Atmel (теперь часть Microchip). Проект AVR был разработан Альф-Эгилем Богеном и Вегаром Волланом, поэтому AVR аббревиатура получила две первые буквы от имен разработчиков: Alf-Egil Bogen Vegard Wollan RISC, после эта аббревиатура стала расшифровываться более официально как Advanced Virtual RISC.</p>
    <p>На 2013 год существовало более 200 модификаций микроконтроллеров, совместимых с i8051, выпускавшихся двумя десятками компаний, и большое количество микроконтроллеров других типов. Популярностью у разработчиков пользуются 8-битные, 16-битные и 32-битные микроконтроллеры PIC фирмы Microchip Technology, микроконтроллеры AVR фирмы Atmel (с 2016 года производятся фирмой Microchip), 16-битные MSP430 фирмы TI, микроконтроллеры Arduino разной разрядности (в основном для обучения, развлечения и т.п.), микроконтроллеры STM32, а также 32-битные микроконтроллеры архитектуры ARM, которую разрабатывает фирма ARM Limited и продаёт лицензии другим фирмам для их производства. Несмотря на популярность в России микроконтроллеров, упомянутых выше, на 2009 год мировой рейтинг по объёму продаж, по данным Gartner Group, выглядел иначе: первое место с большим отрывом занимала Renesas Electronics, на втором — Freescale, на третьем — Samsung, затем шли Microchip и TI, далее — все остальные.</p>
  </div>
</article>
</template>
<script>
export default {
  head() {
    return {
		title: 'История'
    };
  },
};
</script>

import Vue from 'vue'

export default Vue.extend({
  name: 'HistoryPage'
})