<template lang="pug">
<article>
  <h2 class="text-center">Микроконтроллеры</h2>
  <div class="split-60-40 mobile-no-split">
    <div class="p-3">
      <p>Микроконтроллеры являются важной и неотъемлемой (хотя и вполне заменяемой более современными аналогами вроде Raspberry PI) частью нашей жизни, хотя зачастую мы даже не знаем об этом. Микроконтроллеры являются сердцем многих современных приборов, в том числе и бытовых.  </p>
      <p>В современном мире человеку важно знать и понимать, чем они являются и для чего предназначаются, как они устроены. Многие люди интересуются, как с ними работать и как их можно использовать в повседневной жизни. Например, термометр или часы можно сделать самому, а не покупать (да, скорее всего, он будет дороже аналогов, но зато он сделан собственноручно, а также подлежит модификациям).</p>
      <p>Этот сайт как раз и посвящён теме микроконтроллеров и их применения в нашей жизни.</p>
    </div>
    <figure class="text-center mobile-first">
      <img src="../assets/img/Attiny817-XPro.png" alt="Attiny817-XPro" title="Attiny817-XPro" width="95%">
      <figcaption>Attiny817-XPro</figcaption>
    </figure>
  </div>
</article>
</template>
<script>
export default {
  head() {
    return {
		title: 'Главная'
    };
  },
};
</script>

import Vue from 'vue'

export default Vue.extend({
  name: 'IndexPage'
})