<template lang="pug">
<article>
    <h2 class="text-center">Применение</h2>
    <div class="p-3">
        <div class="split-75-25">
            <div>
                <p>Цель применения микроконтроллеров – сокращение числа компонентов, уменьшение размеров и снижение стоимости приборов (систем).</p>
                <p>Микроконтроллеры предназначены для решения задач управления, контроля, регулирования и первичной обработки информации и менее эффективны при реализации сложных алгоритмов обработки данных.</p>
                <h3>Микроконтроллеры применяются во многих технических устройствах:</h3>
                <ol>
                    <li>Использование для замены сложных логических схем. Если нет требований к быстродействию, потому что все же программа, будет вычислять логическую функцию, может вносить задержку значительно больше, чем схема, построенная на элементах дискретной логики (микросхемы серии К155, К176 и аналогичные).</li>
                    <li>Применение в различных роботизированных устройствах, включая беспилотные летательные аппараты;</li>
                    <li>Например, квадрокоптер руководствуется платой «Crius MultiWii SE», которая построена на микроконтроллере AVR ATMEGA328P. Он обрабатывает сигналы с датчиков углов наклона, ускорений, давления, магнитного поля (компас), и позволяет осуществлять стабилизацию полета</li>
                    <li>Просто разные интересные гаджеты, типа часов, термометров,  и т.д. </li>
                    <li>Блоки управления бытовой техники (стиральная машина, кухонные комбайны, микроволновые печи и т.д.), аудио-техникой (регулировка с пультов д/у). Также часто используются в качестве управляющих устройств в стабилизаторах напряжения. </li>
                        <ul><li><p>Например, релейные стабилизаторы в основном построены на микроконтроллере, который, измеряя представленную на вход АЦП напряжение, делает вывод, как следует включить обмотки трансформатора, чтобы на выходе было около 220.</p></li></ul>
                    <li>Различные программаторы и другие устройства - выступают преобразователями интерфейса от ПК к другим устройствам. </li>
                        <ul><li><p>Например, K-Line адаптер для диагностики инжекторных двигателей.</p></li></ul>
                </ol>
            </div>
            <div class="p-4">
                <figure class="mx-auto">
                    <img src="img/DE41-00342A.jpg" alt="Панель управления микроволновкой SAMSUNG DE41-00342A" title="DE41-00342A" class="mx-auto" width="100%"/>
                    <figcaption>
                        <p>Панель управления микроволновкой SAMSUNG DE41-00342A</p>
                    </figcaption>
                </figure>
                <figure class="mx-auto">
                    <img src="img/Crius MultiWii SE.jpg" alt="Crius MultiWii SE" title="Crius MultiWii SE" class="mx-auto" width="100%"/>
                    <figcaption>
                        <p>Плата Crius MultiWii SE</p>
                    </figcaption>
                </figure>
            </div>
        </div>
    </div>
</article>
</template>

import Vue from 'vue'

export default Vue.extend({
    name: 'UsagePage'
})