<template lang="pug">
<article>
    <h2 class="text-center">Применение</h2>
    <div class="p-3">
        <p>Микроконтро́ллер (англ. Micro Controller Unit, MCU) — микросхема, предназначенная для управления электронными устройствами.</p>
        <p>Специализированный микропроцессор, предназначенный для построения устройств управления техническими объектами и технологическими процессами.</p>
        <p>Типичный микроконтроллер сочетает на одном кристалле функции процессора и периферийных устройств, содержит ОЗУ и/или ПЗУ. По сути, это однокристальный компьютер, способный выполнять относительно простые задачи.</p>
        <p>Отличается от микропроцессора интегрированными в микросхему устройствами ввода-вывода, таймерами и другими периферийными устройствами.</p>
        <p></p>
        <p>Назначение микроконтроллеров</p>
        <p>Цель применения микроконтроллеров – сокращение числа компонентов, уменьшение размеров и снижение стоимости приборов (систем).</p>
        <h2>Микроконтроллеры применяются во многих технических устройствах:</h2>
        <ol>
            <li>Использование для замены сложных логических схем. Если нет требований к быстродействию, потому что все же программа, будет вычислять логическую функцию, может вносить задержку значительно больше, чем схема, построенная на элементах дискретной логики (микросхемы серии К155, К176 и аналогичные).</li>
            <li>Применение в различных роботизированных устройствах, включая беспилотные летательные аппараты;</li>
            <li>Например, квадрокоптер руководствуется платой «Crius MultiWii SE», которая построена на микроконтроллере AVR ATMEGA328P. Он обрабатывает сигналы с датчиков углов наклона, ускорений, давления, магнитного поля (компас), и позволяет осуществлять стабилизацию полета</li>
            <li>Просто разные интересные гаджеты, типа часов, термометров,  и т.д. </li>
            <li>Блоки управления бытовой техники (стиральная машина, кухонные комбайны, микроволновые печи и т.д.), аудио-техникой (регулировка с пультов д/у). Также часто используются в качестве управляющих устройств в стабилизаторах напряжения. </li>
                <ul><li><p>Например, релейные стабилизаторы в основном построены на микроконтроллере, который, измеряя представленную на вход АЦП напряжение, делает вывод, как следует включить обмотки трансформатора, чтобы на выходе было около 220.</p></li></ul>
            <li>Различные программаторы и другие устройства - выступают преобразователями интерфейса от ПК к другим устройствам. </li>
                <ul><li><p>Например, K-Line адаптер для диагностики инжекторных двигателей.</p></li></ul>
        </ol>
        <h3>Характерные черты микроконтроллеров</h3>
        <ul>
            <li>RISC-архитектура (RISC – Reduced Instruction Set Computer – вычислитель с сокращённым набором команд);</li>
            <li>Незначительная ёмкость памяти;</li>
            <li>Физическое и логическое разделение памяти программ и памяти данных;</li>
            <li>Система команд ориентирована на решение задачи управления.</li>
        </ul>
        <p>Микроконтроллеры предназначены для решения задач управления, контроля, регулирования и первичной обработки информации и менее эффективны при реализации сложных алгоритмов обработки данных.</p>
        <p>Типовая структура микроконтроллера включает в себя три базовых типа устройств:</p>
        <ol>
            <li>Центральный процессор (CPU – Central Processing Unit);</li>
            <li>Оперативную память (ОЗУ, RAM – Random Access Memory) и постоянную память (ПЗУ, ROM – Read Only Memory), которая служит для хранения данных и программ;</li>
            <li>Порты ввода/вывода (Port I/O – Input/Output Devices), служащие для связи микропроцессорной системы с внешними устройствами – приема (ввода, чтения, Read) входных сигналов и выдачи (вывода, записи, Write) выходных сигналов.</li>
        </ol>
        <p>Эти узлы соединены между собой общей системной шиной (магистралью), по которой производится весь обмен информацией в микропроцессорной системе.</p>
    </div>
</article>
</template>

import Vue from 'vue'

export default Vue.extend({
    name: 'UsagePage'
})